; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	infrared1 - mode
	spectrograph6 - mode
	infrared5 - mode
	thermograph2 - mode
	spectrograph4 - mode
	spectrograph3 - mode
	spectrograph0 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Planet6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph6)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared5)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation3)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star1)
	(supports instrument3 spectrograph4)
	(supports instrument3 spectrograph3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 spectrograph0)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph2)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite2 Phenomenon8)
	(have_image Planet6 spectrograph6)
	(have_image Planet6 infrared5)
	(have_image Planet7 infrared1)
	(have_image Phenomenon8 spectrograph0)
	(have_image Phenomenon8 spectrograph4)
	(have_image Phenomenon9 spectrograph4)
	(have_image Phenomenon9 spectrograph3)
	(have_image Phenomenon10 spectrograph6)
	(have_image Phenomenon10 spectrograph4)
	(have_image Planet11 spectrograph6)
	(have_image Star12 spectrograph6)
	(have_image Star12 spectrograph0)
	(have_image Star13 infrared1)
	(have_image Star13 infrared5)
))

)

; plan
1. (turn_to satellite0 groundstation4 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 16
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 16
3. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 1 of 16
4. (turn_to satellite0 star13 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star13)
   goals met: 0 of 16
5. (take_image satellite0 star13 instrument1 infrared5)
   added: (have_image star13 infrared5)
   goals met: 1 of 16
6. (turn_to satellite0 planet6 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 planet6)
   goals met: 1 of 16
7. (take_image satellite0 planet6 instrument1 infrared5)
   added: (have_image planet6 infrared5)
   goals met: 2 of 16
8. (turn_to satellite0 groundstation2 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 16
9. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 16
10. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 16
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 16
12. (calibrate satellite1 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 2 of 16
13. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 2 of 16
14. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 2 of 16
15. (turn_to satellite0 phenomenon10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon10)
   goals met: 2 of 16
16. (take_image satellite0 phenomenon10 instrument0 spectrograph6)
   added: (have_image phenomenon10 spectrograph6)
   goals met: 3 of 16
17. (turn_to satellite0 phenomenon9 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 16
18. (take_image satellite0 phenomenon9 instrument0 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 4 of 16
19. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 4 of 16
20. (take_image satellite0 planet11 instrument0 spectrograph6)
   added: (have_image planet11 spectrograph6)
   goals met: 5 of 16
21. (turn_to satellite0 planet6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet6)
   goals met: 5 of 16
22. (take_image satellite0 planet6 instrument0 spectrograph6)
   added: (have_image planet6 spectrograph6)
   goals met: 6 of 16
23. (turn_to satellite0 star12 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star12)
   goals met: 6 of 16
24. (take_image satellite0 star12 instrument0 spectrograph6)
   added: (have_image star12 spectrograph6)
   goals met: 7 of 16
25. (turn_to satellite0 groundstation4 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 groundstation4)
   goals met: 8 of 16
26. (turn_to satellite1 phenomenon8 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon8)
   goals met: 8 of 16
27. (take_image satellite1 phenomenon8 instrument2 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 9 of 16
28. (turn_to satellite1 star12 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star12)
   goals met: 9 of 16
29. (take_image satellite1 star12 instrument2 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 10 of 16
30. (turn_to satellite2 groundstation2 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation2)
   goals met: 10 of 16
31. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 10 of 16
32. (turn_to satellite2 phenomenon10 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon10)
   goals met: 10 of 16
33. (take_image satellite2 phenomenon10 instrument5 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 11 of 16
34. (turn_to satellite2 phenomenon9 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon9)
   goals met: 11 of 16
35. (take_image satellite2 phenomenon9 instrument5 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 12 of 16
36. (turn_to satellite2 planet7 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet7)
   goals met: 12 of 16
37. (take_image satellite2 planet7 instrument5 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 13 of 16
38. (turn_to satellite2 star13 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star13)
   goals met: 13 of 16
39. (take_image satellite2 star13 instrument5 infrared1)
   added: (have_image star13 infrared1)
   goals met: 14 of 16
40. (turn_to satellite2 phenomenon8 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 phenomenon8)
   goals met: 15 of 16
41. (take_image satellite2 phenomenon8 instrument5 spectrograph4)
   added: (have_image phenomenon8 spectrograph4)
   goals met: 16 of 16
